{ 
    "Info":
    {
        "DisplayTitle": "Custom",
        "Category": "Filters",
        "Description": "Allows the application of a user-defined convolution matrix to the image, enabling the creation of a wide range of effects such as blurring, sharpening, edge detection, and embossing. By adjusting the values in the convolution matrix, unique image transformations can be achieved."
    },
    "Content": 
    {
        "Key": "Modificator",
        "Data": 
        {
            "Path": "Filter / Other / Custom",
            "Properties": 
            [               
                {
                    "Name": "Convolution Matrix",
                    "Summary": "Defines a 5x5 grid of values that determines how neighboring pixels influence each other in the filtering process. Each value in the matrix specifies the weight applied to the corresponding neighboring pixel, allowing control over the image's transformation. This matrix is key to crafting custom effects, from subtle enhancements to pronounced alterations.",
                    "Type": "Matrix5x5"
                },
                {
                    "Name": "Offset",
                    "Summary": "Adds a constant value to each pixel after the convolution matrix is applied. This adjustment can brighten or darken the image, ensuring that the resulting pixel values remain within a visible range. It’s especially useful when the convolution process reduces overall brightness.",
                    "Type": "Slider"
                },
                {
                    "Name": "Scale",
                    "Summary": "Divides the sum of the weighted pixel values generated by the convolution matrix, normalizing the output. This ensures that the final pixel values fall within the acceptable range, preventing overly bright or dark results. Adjusting the scale affects the intensity of the applied effect, providing finer control over the filter’s impact.",
                    "Type": "Slider"
                }
            ],
            "Preview": 
            {
                "Original": "/img/previews/filters/custom_convolution_example_original.jpg",
                "Adjusted": "/img/previews/filters/custom_convolution_example_adjusted.jpg"
            }
        }
    }
}